Repository: Sheev13/logic-simulator
Catalog: locales/*/LC_MESSAGES/*.po
Languages: es

source: Invalid command. See User Guide for help.
es: El comando es inválido. Consulte el manual de uso del programa para obtener consejos.

source: Error! Expected a name.
es: ¡Error! Esperaba un nombre.

source: Error! Unknown name.
es: ¡Error! Nombre desconocido.

source: Error! Expected a number.
es: ¡Error! Esperaba un número.

source: Number out of range.
es: El número está fuera de rango.

source: Successfully set switch.
es: El interruptor es puesto.

source: Error! Invalid switch.
es: ¡Error! El interruptor es inválido.

source: Successfully made monitor.
es: El monitor es creado.

source: Error! Could not make monitor.
es: ¡Error! No puede añadir el monitor.

source: Successfully zapped monitor.
es: El monitor es eliminado.

source: Error! Could not zap monitor.
es: ¡Error! No puede eliminar el monitor.

source: Error! Network oscillating.
es: ¡Error! La red está oscilando.

source: Running for
es: En ejecución por

source: cycles.
es: ciclos.

source: Invalid number of cycles.
es: Número de ciclos es inválido.

source: Error! Nothing to continue. Run first.
es: ¡Error! Debes ejecutar antes de continuar.

source: Continuing for
es: Continuando por

source: Error! Invalid number of cycles.
es: ¡Error! Número de ciclos es inválido.

source: Successfully made new connection.
es: La conexión nuevo es creado.

source: Could not make connection.
es: No puede crear la conexión.

source: Welcome to the Logic Simulator!
es: ¡Bienvenido al simulador de lógica!

source: See User Guide for help.
es: Consulte el manual de uso del programa para obtener consejos.

source: Open
es: Abre

source: About
es: Acerca de

source: Exit
es: Salir

source: Command Line Guide
es: Manual de la línea de comandos

source: Canvas Controls
es: Controles del lienzo

source: Sidebar Guide
es: Manual de la columna anexa

source: File
es: Archivo

source: User Guide
es: Manual de uso del programa

source: Browse
es: Navegar

source: Devices:
es: Dispositivos:

source: Monitors:
es: Monitores:

source: Add new monitor
es: Añadir nuevo monitor

source: (click to remove)
es: (clic para eliminar)

source: Clear All
es: Borrar todos

source: Cycles:
es: Ciclos:

source: Run
es: Ejecutar

source: Continue
es: Continuar

source: Clear Canvas
es: Borrar lienzo

source: Command line input. See User Guide for help.
es: Línea de comandos. Consulte el manual para obtener consejos.

source: No file selected. Exiting GUI.
es: Nada archivo eligido. Saliendo de GUI.

source: Exiting GUI
es: Saliendo de GUI

source: Switches (toggle on/off):
es: Interruptores (haga clic para cambiar):

source: No switches in this circuit.
es: No hay interruptores en este circuito.

source: inputs
es: insumos

source: half-period
es: semiperíodo

source: New circuit loaded.
es: Nuevo circuito cargado.

source: from
es: de

source: to
es: a

source: Current Connections
es: Conexiones actuales

source: Delete Connection
es: Eliminar conexión

source: Created by
es: Creado por

source: Logic Simulator
es: El simulador de lógica

source: About Logsim
es: Acerca de logsim

source: Choose a new output to connect input
es: Elige una nueva valor para conectar a

source: Replace Connection
es: Reemplazar conexión

source: You must select a new connection for this input.
es: Debes elegir una conexión nuevo.

source: Error - Connection Needed
es: Error - conexión necesaria

source: Number of cycles:
es: Número de ciclos:

source: Canvas cleared. Press run to start simulation again.
es: El lienzo borrado. Haga clic 'Ejecutar' para iniciar la simulación otra vez.

source: turned
es: es

source: All monitors destroyed.
es: Todos monitores eliminados.

source: Already monitoring
es: Ya monitoreando

source: Invalid monitor
es: Monitor inválido

source: Enter command line inputs in the bottom left of
es: Ingrese en la línea de comandos en el parte inferior izquierda del

source: the interface.
es: interfaz.

source: Possible commands:
es: Comandos posibles:

source: Run simulator for N cycles
es: Ejecutar el simulador por N ciclos

source: Continue running simulation
es: Continuar la simulación

source: for N cycles
es: por N ciclos

source: Set switch X to N (0 or 1)
es: Poner interruptor X a N (0 o 1)

source: Start monitoring output signal X
es: Empezar a monitorizar X

source: Stop monitoring X
es: Dejar de monitorear X

source: Signals on the canvas can be manipulated to
es: Las señales en el lienzo se pueden manipular para

source: better view them.
es: verlas mejor.

source: Scroll in to zoom in
es: Desplácese para acercar

source: Scroll out to zoom out - this may
es: Desplácese para alejar - esto puede

source: be useful if you have many monitors
es: ser útil si hay muchos monitores

source: Click and hold to drag the signals
es: Haga clic y mantenga presionado para arrastrar las señales

source: around the space
es: alrededor del espacio

source: The sidebar can be used to adjust simulation
es: La columna anexa puede utilizar

source: settings
es: ajustar la simulación

source: Click 'Browse' to load a new circuit file.
es: Haga clic 'Navegar' para cargar un archivo nuevo.

source: See the list of devices to decide what you
es: Consulte la lista de los dispositivos para decider lo que

source: want to monitor. Hover on a device to see
es: quieres monitorizar. Pase el cursor sobre un dispositivo para ver

source: its full name, kind and qualifier information.
es: su nombre, tipo y información de calificador.

source: To remove a connection before or during a
es: Para eliminar una conexión antes de o durando una

source: simulation, choose from the dropdown list
es: simulación, elige de la lista desplegable

source: next to 'Devices' and click 'Delete Connection.
es: al lado de 'Dispositivos' y haga clic 'Eliminar conexión'.

source: Select a new output
es: Elige una nueva valor

source: to connect to the input from the deleted
es: para conectar al insumo de la conexión

source: connection.
es: eliminada.

source: Click the switch buttons to toggle on or off.
es: Haga clic en los butones de los interruptores para cambiar.

source: Type the name of an output in the 'Add new
es: Escribe el nombre de una valor en el cuadro 'Añadir nueva

source: monitor' box to add to monitors.
es: monitor' para añadir a la lista de monitores.

source: Press 'Clear All' to remove all monitors.
es: Haga clic 'Borrar todos' para eliminar todos monitores.

source: Click on an individual monitor button to
es: Haga clic en un monitor individual para

source: remove it.
es: eliminarlo.

source: Adjust the number of cycles with the spinner.
es: Adjusta el número de ciclos con la ruleta.

source: Press 'Run' or 'Continue' to start the
es: Haga clic 'Ejecutar' o 'Continuar' para iniciar la

source: simulation.
es: simulación.

source: Press 'Clear Canvas' to reset the
es: Haga clic 'Borrar lienzo' para restablacer la

source: Unable to load file. Old file will remain loaded.
es: No puede cargar el archivo. El archivo antiguo permanecerá cargado.

source: Unable to load file. Please choose valid file.
es: No puede cargar el archivo. Elige un archivo válido.

source: Empty definition file was loaded.
es: El archivo es vacío.

source: Completely parsed the definition file.
es: El archivo es analizado completamente.

source: error(s) found in total.
es: error(es) encontrados en total.

source: Multiple device lists found.
es: Varias listas de dispositivos encontrados.

source: Multiple connections lists found.
es: Varias listas de conexiones encontrados.

source: can't parse connections if not done devices
es: no puede analizar las conexiones si los dispositivos no están analizados

source: Multiple monitors lists found.
es: Varias listas de monitores encontrados.

source: can't parse monitors if not done devices
es: no puede analizar los monitores si los dispositivos no están analizados

source: not DEVICES, CONNECTIONS, MONITORS nor EOF
es: no es DEVICES, CONNECTIONS, MONITORS, ni EOF

source: expected
es: esparado

source: missed semicolon at end of device definition,
es: falta el punto y coma después de la definición del dispositivo,

source: will end up skipping the device after
es: saltará el siguiente dispositivo

source: invalid character encountered
es: carácter inválido encontrado

source: Invalid input to a DEVICES list. Devices
es: Insumo inválido en una lista 'DEVICES'. Un dispositivo

source: should start with '{', or the list should
es: debe empezar con '{', o la lista debe

source: end with ']'
es: finir con ']'

source: Successfully parsed the DEVICES list!
es: ¡La lista DEVICES es analizada!

source: Successfully parsed the CONNECTIONS list!
es: ¡La lista CONNECTIONS es analizada!

source: Successfully parsed the MONITORS list!
es: ¡La lista MONITORS es analizada!

source: error(s) found
es: error(es) encontrados

source: when parsing the DEVICES list
es: cuando analizando la lista DEVICES

source: missed a semicolon in device id,
es: falta un punto y coma en 'device id',

source: will skip to next device
es: saltará al siguiente dispositivo

source: missed a semicolon in device kind,
es: falta un punto y coma en 'device kind',

source: missed a semicolon in device qual,
es: falta un punto y coma en 'device qual',

source: qualifier not present.
es: calificador no está presente.

source: qualifier is invalid.
es: calificador es inválido.

source: Qualifier provided for
es: El calificador por

source: when there should be none.
es: no se debe estar presente.

source: Device kind
es: Tipo de dispositivo

source: not recognised.
es: no es reconocido.

source: Device
es: El dispositivo

source: already present.
es: ya es presente.

source: expected id keyword here
es: 'id keyword' esparado

source: Invalid name provided -
es: Nombre es inválido -

source: a keyword cannot be used as a device name
es: un nombre de dispositivo no puede ser un 'keyword'

source: a device name should be alphanumeric
es: un nombre de dispositivo debe ser alfanumérico

source: Missing semicolon
es: Falta un punto y coma

source: Device type must be alphanumeric
es: El tipo de dispositivo debe ser alfanumérico

source: unsupported qualifier input
es: este calificador no permitido

source: Cannot use a KEYWORD for a signal name
es: Un nombre de señal no puede ser un 'keyword'

source: Unknown Error
es: Error desconocido

source: error(s) found when parsing the
es: error(es) encontrados cuando analizando

source: CONNECTIONS list
es: la lista CONNECTIONS

source: MONITORS list
es: la lista MONITORS

source: No connection found before semicolon
es: Ninguna conexión encontrado antes de punto y coma

source: missed colon in connection,
es: falta colon en conexión,

source: will skip to next connection
es: saltará a la siguiente conexión

source: Either left or right device is absent
es: Un dispositivo no es presente

source: input is already connected.
es: insumo ya esta conectado.

source: Both ports are inputs.
es: Los dos puertos son insumos.

source: Right port id is invalid.
es: 'id' del puerto a la derecha es inválido.

source: Both ports are outputs.
es: Los dos puertos son valores.

source: Expected an output name here
es: Un nombre de valor esparado

source: expected an output name here
es: un nombre de puerto esparado

source: missing ':' or ';'
es: falta ':' o ';'

source: No signal found before semicolon
es: Ninguna señal encontrada antes de punto y coma

source: Device you are trying to monitor is absent.
es: El dispositivo no es presente.

source: is not an output.
es: no es una valor.

source: Unclosed comment found - did you want to use
es: Un comentario no cerrado encontrado. ¿Quieres usar

source: '/' instead of '#' for your comment?
es: '/', no '#', para tu comentario?

source: ERROR on line
es: ERROR en línea

source: index
es: índice

source: , received
es: , recibido

source: Reached end of file without finding another
es: Llegó al final del archivo sin encontrar

source: semicolon - cannot perform error recovery.
es: otra punto y coma - no se puede recuperar.
